app/controllers/friends_controller.rb

SELECT `friends`.* FROM `friends` WHERE (colour like '%re%')
---
  def index
    @friends = Friend.all

INSERT INTO `friends` (`first_name`, `last_name`, `email`, `phone`, `colour`, `created_at`, `updated_at`, `user_id`) VALUES ('Banana', 'Banana', 'banana@gmail.com', '123', 'yellow', '2021-06-24 04:20:15.135881', '2021-06-24 04:20:15.135881', 1)
---
  def create
    #@friend = Friend.new(friend_params)
    @friend = current_user.friends.build(friend_params)
    respond_to do |format|
      if @friend.save

UPDATE `friends` SET `friends`.`phone` = '312', `friends`.`updated_at` = '2021-06-24 04:23:21.915871' WHERE `friends`.`id` = 2
---
  def update
    respond_to do |format|
      if @friend.update(friend_params)